{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}Table2
       {txt}log:  {res}/Users/Lan/Documents/GitHub/ps1-data-hitsukilan/analysis/output/Table2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Sep 2019, 11:45:09
{txt}
{com}. 
. *** Table 2 Concentration and Skewness ***
. 
. *Gini coefficient, coefficient of variantion, variance of the logs
. ainequal earning[aweight=wgt], cov sdl

{txt}{hline 27}{c TT}{hline 11}
       Inequality measures {c |}    earning
{hline 27}{c +}{hline 11}
  Coefficient of variation {c |}    {res}3.60502
{txt}Standard deviation of logs {c |}    {res}1.13501
          {txt}Gini coefficient {c |}    {res}0.63585
{txt}Theil index (GE(a), a = 1) {c |}    {res}1.17036
{txt}{hline 27}{c BT}{hline 11}

{com}. mat a = r(b)
{txt}
{com}. ainequal income[aweight=wgt], cov sdl

{txt}{hline 27}{c TT}{hline 11}
       Inequality measures {c |}     income
{hline 27}{c +}{hline 11}
  Coefficient of variation {c |}    {res}4.31715
{txt}Standard deviation of logs {c |}    {res}0.99638
          {txt}Gini coefficient {c |}    {res}0.57499
{txt}Theil index (GE(a), a = 1) {c |}    {res}0.87812
{txt}{hline 27}{c BT}{hline 11}

{com}. mat b = r(b)
{txt}
{com}. ainequal wealth[aweight=wgt], cov sdl

{txt}{hline 27}{c TT}{hline 11}
       Inequality measures {c |}     wealth
{hline 27}{c +}{hline 11}
  Coefficient of variation {c |}    {res}6.00925
{txt}Standard deviation of logs {c |}    {res}2.12888
          {txt}Gini coefficient {c |}    {res}0.81616
{txt}Theil index (GE(a), a = 1) {c |}    {res}1.99538
{txt}{hline 27}{c BT}{hline 11}

{com}. mat c= r(b)
{txt}
{com}. 
. mat total = [a,b,c]
{txt}
{com}. mat colname total = earning income wealth
{txt}
{com}. mat list total
{res}
{txt}total[4,3]
              earning     income     wealth
 ineq:gini {res} .63585043  .57498518   .8161567
{txt}ineq:theil {res} 1.1703599  .87812309  1.9953776
{txt}  ineq:cov {res} 3.6050247  4.3171526  6.0092493
{txt}  ineq:sdl {res} 1.1350065  .99637655  2.1288792
{reset}
{com}. 
. *top 1%/lowest40%
. *calculate manually
. 
. 
. *location of mean (%) & mean/median
. *get number and calculate manually
. 
. tabstat earning income wealth [aweight=wgt], statistics(mean median)

{txt}   stats {...}
{c |}{...}
   earning    income    wealth
{hline 9}{c +}{hline 30}
{ralign 8:mean} {...}
{c |}{...}
 {res} 63.70282  83.43201  555.7535
{txt}{ralign 8:p50} {...}
{c |}{...}
 {res} 36.95121  47.21544  120.7721
{txt}{hline 9}{c BT}{hline 30}

{com}. 
. pctile earning_pct = earning [aweight=wgt], nq(100) gen(percent)
{txt}
{com}. pctile income_pct =income [aweight=wgt], nq(100)
{txt}
{com}. pctile wealth_pct = wealth [aweight=wgt], nq(100)
{txt}
{com}. 
. list percent earning_pct income_pct wealth_pct in 1/99
{txt}
     {c TLC}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c TRC}
     {c |} {res}percent   earnin~t   income~t   wealth_~t {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
  1. {c |} {res}      1          0   4.208333   -31.20113 {txt}{c |}
  2. {c |} {res}      2          0   6.158535    -18.7646 {txt}{c |}
  3. {c |} {res}      3          0     7.2876   -10.71977 {txt}{c |}
  4. {c |} {res}      4          0   8.006096   -7.086629 {txt}{c |}
  5. {c |} {res}      5          0   8.909348   -4.591337 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
  6. {c |} {res}      6          0    9.54573    -1.96629 {txt}{c |}
  7. {c |} {res}      7          0   10.26423   -.7685499 {txt}{c |}
  8. {c |} {res}      8          0   10.77744           0 {txt}{c |}
  9. {c |} {res}      9          0   11.29065           0 {txt}{c |}
 10. {c |} {res}     10          0   12.31707    .0299435 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 11. {c |} {res}     11          0   12.36839    .3094162 {txt}{c |}
 12. {c |} {res}     12          0   13.34349    .9482109 {txt}{c |}
 13. {c |} {res}     13          0   14.36992    1.596987 {txt}{c |}
 14. {c |} {res}     14          0   15.39634    2.215819 {txt}{c |}
 15. {c |} {res}     15          0   16.32012     2.99435 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 16. {c |} {res}     16          0   16.93597    3.752919 {txt}{c |}
 17. {c |} {res}     17          0   17.65447     4.62128 {txt}{c |}
 18. {c |} {res}     18          0   18.47561    5.489642 {txt}{c |}
 19. {c |} {res}     19          0   19.50203    6.338041 {txt}{c |}
 20. {c |} {res}     20          0    20.0255    7.316195 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 21. {c |} {res}     21   1.334349   20.52845    8.184557 {txt}{c |}
 22. {c |} {res}     22   3.079268   21.55487    9.781544 {txt}{c |}
 23. {c |} {res}     23   4.310975    22.5813    11.22881 {txt}{c |}
 24. {c |} {res}     24   5.314816   23.60772    12.55631 {txt}{c |}
 25. {c |} {res}     25   6.774389     23.813    14.12335 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 26. {c |} {res}     26   8.314022   24.63414    16.20942 {txt}{c |}
 27. {c |} {res}     27   9.853656   25.66056    18.59492 {txt}{c |}
 28. {c |} {res}     28   10.26423   26.17377    20.66102 {txt}{c |}
 29. {c |} {res}     29   12.31707   27.09756    23.65537 {txt}{c |}
 30. {c |} {res}     30   13.34349   28.24715        26.5 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 31. {c |} {res}     31   15.39634   28.73983    29.52429 {txt}{c |}
 32. {c |} {res}     32   15.94445   29.76625    32.71827 {txt}{c |}
 33. {c |} {res}     33   17.44918   30.79268    36.23264 {txt}{c |}
 34. {c |} {res}     34   18.47561   30.87479    39.92467 {txt}{c |}
 35. {c |} {res}     35   20.52845    31.8191    43.60772 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 36. {c |} {res}     36   21.55487   32.84552    48.23898 {txt}{c |}
 37. {c |} {res}     37    22.5813   33.87194    52.12165 {txt}{c |}
 38. {c |} {res}     38   23.60772   34.89837    56.20395 {txt}{c |}
 39. {c |} {res}     39   25.66056   35.92479    60.18644 {txt}{c |}
 40. {c |} {res}     40   25.66056   36.23272    64.79275 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 41. {c |} {res}     41   26.68699   36.95121    69.66855 {txt}{c |}
 42. {c |} {res}     42   27.71341   37.97763    74.06026 {txt}{c |}
 43. {c |} {res}     43   28.73983   39.00406     78.3821 {txt}{c |}
 44. {c |} {res}     44   30.45498   41.05587    85.23917 {txt}{c |}
 45. {c |} {res}     45   30.79268    41.0569    90.58907 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 46. {c |} {res}     46    31.8191   42.08332    96.21845 {txt}{c |}
 47. {c |} {res}     47   32.84552   43.10975    101.4087 {txt}{c |}
 48. {c |} {res}     48   34.89837   44.63911    106.8983 {txt}{c |}
 49. {c |} {res}     49   35.92479   46.18901    113.2363 {txt}{c |}
 50. {c |} {res}     50   36.95121   47.21544    120.7721 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 51. {c |} {res}     51   37.97763   48.24186    128.1582 {txt}{c |}
 52. {c |} {res}     52   39.00406   49.26828    133.7476 {txt}{c |}
 53. {c |} {res}     53    41.0569    50.2947    140.7744 {txt}{c |}
 54. {c |} {res}     54    41.0569   51.32113    146.6832 {txt}{c |}
 55. {c |} {res}     55   43.10975   52.34755     155.307 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 56. {c |} {res}     56   44.13617    53.6819    162.9126 {txt}{c |}
 57. {c |} {res}     57   46.18901   55.42682    171.0083 {txt}{c |}
 58. {c |} {res}     58   47.21544   56.45324     179.661 {txt}{c |}
 59. {c |} {res}     59   49.15312   57.47966    189.0832 {txt}{c |}
 60. {c |} {res}     60    50.2947   58.71137    197.5273 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 61. {c |} {res}     61   51.32113   60.55893    207.8079 {txt}{c |}
 62. {c |} {res}     62   52.34755   61.58535    215.5932 {txt}{c |}
 63. {c |} {res}     63   53.37397    63.6382    225.0753 {txt}{c |}
 64. {c |} {res}     64   55.42682   65.17783    235.1563 {txt}{c |}
 65. {c |} {res}     65   56.45324   66.71746    243.3309 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 66. {c |} {res}     66   58.16839   68.77031    251.9247 {txt}{c |}
 67. {c |} {res}     67   59.53251   70.47417    262.2053 {txt}{c |}
 68. {c |} {res}     68   61.58535   71.84958    276.1989 {txt}{c |}
 69. {c |} {res}     69   62.99155     72.876    286.9586 {txt}{c |}
 70. {c |} {res}     70   65.49838   74.92885    299.7344 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 71. {c |} {res}     71   66.71746   76.98169     312.181 {txt}{c |}
 72. {c |} {res}     72   68.77031   78.00811    325.5857 {txt}{c |}
 73. {c |} {res}     73   71.84958   81.08738    337.1638 {txt}{c |}
 74. {c |} {res}     74     72.876   82.62701    354.8305 {txt}{c |}
 75. {c |} {res}     75   74.92885   85.39835     372.048 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 76. {c |} {res}     76   76.98169   88.05679    388.0378 {txt}{c |}
 77. {c |} {res}     77   80.06096   91.14632    409.8267 {txt}{c |}
 78. {c |} {res}     78    82.1138   93.40445    438.1732 {txt}{c |}
 79. {c |} {res}     79   85.19307    95.7139    462.9265 {txt}{c |}
 80. {c |} {res}     80   87.31345   98.53656    495.9642 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 81. {c |} {res}     81   92.01262   102.6423    525.4086 {txt}{c |}
 82. {c |} {res}     82   94.43087   104.8183    560.9416 {txt}{c |}
 83. {c |} {res}     83   97.51014   107.7744    583.3992 {txt}{c |}
 84. {c |} {res}     84   100.5894   111.0384    619.2316 {txt}{c |}
 85. {c |} {res}     85   102.6423   113.9842    654.4651 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 86. {c |} {res}     86   106.2963    118.911    688.3512 {txt}{c |}
 87. {c |} {res}     87   110.6975   123.1707    732.5378 {txt}{c |}
 88. {c |} {res}     88   115.9857   127.1738    779.1299 {txt}{c |}
 89. {c |} {res}     89   123.1266   133.4349    831.0819 {txt}{c |}
 90. {c |} {res}     90   125.8281   141.7182    908.5856 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 91. {c |} {res}     91   133.4349   150.8841    998.9152 {txt}{c |}
 92. {c |} {res}     92   143.6992   160.7583    1099.506 {txt}{c |}
 93. {c |} {res}     93   153.9634   173.4962    1200.834 {txt}{c |}
 94. {c |} {res}     94   164.2276   189.8882    1493.083 {txt}{c |}
 95. {c |} {res}     95   179.8179   206.8241    1896.591 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 96. {c |} {res}     96   205.2845   240.6961    2381.207 {txt}{c |}
 97. {c |} {res}     97   236.7659   287.3983    3178.004 {txt}{c |}
 98. {c |} {res}     98   298.0988    388.193    4629.764 {txt}{c |}
 99. {c |} {res}     99   496.0495   679.3994    8358.769 {txt}{c |}
     {c BLC}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c BRC}

{com}. 
. ***The end of Table 2 ***
. 
. log close Table2
      {txt}name:  {res}Table2
       {txt}log:  {res}/Users/Lan/Documents/GitHub/ps1-data-hitsukilan/analysis/output/Table2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Sep 2019, 11:45:10
{txt}{.-}
{smcl}
{txt}{sf}{ul off}