{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}Table2
       {txt}log:  {res}/Users/Lan/Documents/GitHub/ps1-data-hitsukilan/analysis/output/Table2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Sep 2019, 21:12:02
{txt}
{com}. 
. *** Table 2 Concentration and Skewness ***
. 
. *Gini coefficient, coefficient of variantion, variance of the logs
. ainequal earning[aweight=wgt], cov sdl

{txt}{hline 27}{c TT}{hline 11}
       Inequality measures {c |}    earning
{hline 27}{c +}{hline 11}
  Coefficient of variation {c |}    {res}3.60502
{txt}Standard deviation of logs {c |}    {res}1.13501
          {txt}Gini coefficient {c |}    {res}0.63585
{txt}Theil index (GE(a), a = 1) {c |}    {res}1.17036
{txt}{hline 27}{c BT}{hline 11}

{com}. mat aa = r(b)
{txt}
{com}. ainequal income[aweight=wgt], cov sdl

{txt}{hline 27}{c TT}{hline 11}
       Inequality measures {c |}     income
{hline 27}{c +}{hline 11}
  Coefficient of variation {c |}    {res}4.32446
{txt}Standard deviation of logs {c |}    {res}0.98960
          {txt}Gini coefficient {c |}    {res}0.57416
{txt}Theil index (GE(a), a = 1) {c |}    {res}0.88636
{txt}{hline 27}{c BT}{hline 11}

{com}. mat bb = r(b)
{txt}
{com}. ainequal wealth[aweight=wgt], cov sdl

{txt}{hline 27}{c TT}{hline 11}
       Inequality measures {c |}     wealth
{hline 27}{c +}{hline 11}
  Coefficient of variation {c |}    {res}6.00925
{txt}Standard deviation of logs {c |}    {res}2.12888
          {txt}Gini coefficient {c |}    {res}0.81616
{txt}Theil index (GE(a), a = 1) {c |}    {res}1.99538
{txt}{hline 27}{c BT}{hline 11}

{com}. mat cc= r(b)
{txt}
{com}. 
. mat total = [aa,bb,cc]
{txt}
{com}. mat colname total = earning income wealth
{txt}
{com}. 
. ***top 1%/lowest40%***
. _pctile earning [aweight=wgt],p(40,99)
{txt}
{com}. 
. 
. *location of mean (%) & mean/median
. 
. tabstat earning income wealth [aweight=wgt], statistics(mean median)

{txt}   stats {...}
{c |}{...}
   earning    income    wealth
{hline 9}{c +}{hline 30}
{ralign 8:mean} {...}
{c |}{...}
 {res} 63702.82  97445.98  555753.5
{txt}{ralign 8:p50} {...}
{c |}{...}
 {res} 36951.21  54779.35  120772.1
{txt}{hline 9}{c BT}{hline 30}

{com}. 
. pctile earning_pct = earning [aweight=wgt], nq(100) gen(percent)
{txt}
{com}. pctile income_pct =income [aweight=wgt], nq(100)
{txt}
{com}. pctile wealth_pct = wealth [aweight=wgt], nq(100)
{txt}
{com}. 
. list percent earning_pct income_pct wealth_pct in 1/99
{txt}
     {c TLC}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c TRC}
     {c |} {res}percent   earnin~t   income~t   wealth_~t {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
  1. {c |} {res}      1          0   4763.422   -31201.13 {txt}{c |}
  2. {c |} {res}      2          0   7145.132   -18764.59 {txt}{c |}
  3. {c |} {res}      3          0   8455.073   -10719.77 {txt}{c |}
  4. {c |} {res}      4          0   9407.758   -7086.629 {txt}{c |}
  5. {c |} {res}      5          0   10479.53   -4591.337 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
  6. {c |} {res}      6          0   11313.13    -1966.29 {txt}{c |}
  7. {c |} {res}      7          0   11908.55   -768.5499 {txt}{c |}
  8. {c |} {res}      8          0   13099.41           0 {txt}{c |}
  9. {c |} {res}      9          0   13099.41           0 {txt}{c |}
 10. {c |} {res}     10          0   14290.26     29.9435 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 11. {c |} {res}     11          0   14290.26    309.4162 {txt}{c |}
 12. {c |} {res}     12          0   15481.12    948.2109 {txt}{c |}
 13. {c |} {res}     13          0   16671.98    1596.987 {txt}{c |}
 14. {c |} {res}     14          0   17862.83    2215.819 {txt}{c |}
 15. {c |} {res}     15          0   19053.69     2994.35 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 16. {c |} {res}     16          0   20244.54    3752.919 {txt}{c |}
 17. {c |} {res}     17          0    21435.4     4621.28 {txt}{c |}
 18. {c |} {res}     18          0    21435.4    5489.642 {txt}{c |}
 19. {c |} {res}     19          0   22626.25    6338.041 {txt}{c |}
 20. {c |} {res}     20          0   23817.11    7316.195 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 21. {c |} {res}     21   1334.349   24055.28    8184.557 {txt}{c |}
 22. {c |} {res}     22   3079.268   25007.96    9781.544 {txt}{c |}
 23. {c |} {res}     23   4310.975   26198.82    11228.81 {txt}{c |}
 24. {c |} {res}     24   5314.816   27389.67    12556.31 {txt}{c |}
 25. {c |} {res}     25   6774.389   28580.53    14123.35 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 26. {c |} {res}     26   8314.022   29771.38    16209.42 {txt}{c |}
 27. {c |} {res}     27   9853.656   29771.38    18594.91 {txt}{c |}
 28. {c |} {res}     28   10264.23   30962.24    20661.02 {txt}{c |}
 29. {c |} {res}     29   12317.07    32153.1    23655.37 {txt}{c |}
 30. {c |} {res}     30   13343.49   33343.95       26500 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 31. {c |} {res}     31   15396.34   33343.95    29524.29 {txt}{c |}
 32. {c |} {res}     32   15944.45   34534.81    32718.27 {txt}{c |}
 33. {c |} {res}     33   17449.18   35725.66    36232.64 {txt}{c |}
 34. {c |} {res}     34   18475.61   35725.66    39924.67 {txt}{c |}
 35. {c |} {res}     35   20528.45   36916.52    43607.72 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 36. {c |} {res}     36   21554.87   38107.38    48238.98 {txt}{c |}
 37. {c |} {res}     37   22581.29   39298.23    52121.66 {txt}{c |}
 38. {c |} {res}     38   23607.72   40489.09    56203.95 {txt}{c |}
 39. {c |} {res}     39   25660.56   41679.94    60186.44 {txt}{c |}
 40. {c |} {res}     40   25660.56    42870.8    64792.75 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 41. {c |} {res}     41   26686.99    42870.8    69668.55 {txt}{c |}
 42. {c |} {res}     42   27713.41   44061.65    74060.26 {txt}{c |}
 43. {c |} {res}     43   28739.83    45252.5    78382.11 {txt}{c |}
 44. {c |} {res}     44   30454.98   47634.21    85239.16 {txt}{c |}
 45. {c |} {res}     45   30792.68   47634.21    90589.07 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 46. {c |} {res}     46    31819.1   48825.07    96218.45 {txt}{c |}
 47. {c |} {res}     47   32845.52   50015.93    101408.7 {txt}{c |}
 48. {c |} {res}     48   34898.37   51444.95    106898.3 {txt}{c |}
 49. {c |} {res}     49   35924.79   53588.49    113236.3 {txt}{c |}
 50. {c |} {res}     50   36951.21   54779.35    120772.1 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 51. {c |} {res}     51   37977.63    55970.2    128158.2 {txt}{c |}
 52. {c |} {res}     52   39004.05   57161.06    133747.6 {txt}{c |}
 53. {c |} {res}     53    41056.9   58351.91    140774.4 {txt}{c |}
 54. {c |} {res}     54    41056.9   59542.77    146683.2 {txt}{c |}
 55. {c |} {res}     55   43109.75   60733.63      155307 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 56. {c |} {res}     56   44136.17   63115.34    162912.6 {txt}{c |}
 57. {c |} {res}     57   46189.02   64306.19    171008.3 {txt}{c |}
 58. {c |} {res}     58   47215.44   65497.05      179661 {txt}{c |}
 59. {c |} {res}     59   49153.12   66687.91    189083.2 {txt}{c |}
 60. {c |} {res}     60    50294.7   69069.62    197527.3 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 61. {c |} {res}     61   51321.13   71451.33    207807.9 {txt}{c |}
 62. {c |} {res}     62   52347.55   71451.33    215593.2 {txt}{c |}
 63. {c |} {res}     63   53373.97   73833.04    225075.3 {txt}{c |}
 64. {c |} {res}     64   55426.82   76214.75    235156.3 {txt}{c |}
 65. {c |} {res}     65   56453.24    77405.6    243330.9 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 66. {c |} {res}     66   58168.39   79787.31    251924.7 {txt}{c |}
 67. {c |} {res}     67   59532.51   82169.02    262205.3 {txt}{c |}
 68. {c |} {res}     68   61585.35   83359.88    276198.8 {txt}{c |}
 69. {c |} {res}     69   62991.55   84550.73    286958.6 {txt}{c |}
 70. {c |} {res}     70   65498.38   86932.45    299734.4 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 71. {c |} {res}     71   66717.46   89314.16      312181 {txt}{c |}
 72. {c |} {res}     72   68770.31   90505.01    325585.7 {txt}{c |}
 73. {c |} {res}     73   71849.58   94077.58    337163.8 {txt}{c |}
 74. {c |} {res}     74      72876   96459.29    354830.5 {txt}{c |}
 75. {c |} {res}     75   74928.84      98841      372048 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 76. {c |} {res}     76   76981.69   102413.6    388037.8 {txt}{c |}
 77. {c |} {res}     77   80060.96   105986.1    409826.7 {txt}{c |}
 78. {c |} {res}     78    82113.8     107177    438173.3 {txt}{c |}
 79. {c |} {res}     79   85193.07   110749.6    462926.5 {txt}{c |}
 80. {c |} {res}     80   87313.45   113131.3    495964.2 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 81. {c |} {res}     81   92012.63   119085.5    525408.6 {txt}{c |}
 82. {c |} {res}     82   94430.88   121467.3    560941.6 {txt}{c |}
 83. {c |} {res}     83   97510.14   125039.8    583399.3 {txt}{c |}
 84. {c |} {res}     84   100589.4   128612.4    619231.6 {txt}{c |}
 85. {c |} {res}     85   102642.3     132185    654465.1 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 86. {c |} {res}     86   106296.3   138139.2    688351.2 {txt}{c |}
 87. {c |} {res}     87   110697.5   142902.7    732537.8 {txt}{c |}
 88. {c |} {res}     88   115985.7   147666.1    779129.9 {txt}{c |}
 89. {c |} {res}     89   123126.6   154811.2    831081.9 {txt}{c |}
 90. {c |} {res}     90   125828.1   163147.2    908585.6 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 91. {c |} {res}     91   133434.9   173864.9    998915.2 {txt}{c |}
 92. {c |} {res}     92   143699.2   185773.4     1099506 {txt}{c |}
 93. {c |} {res}     93   153963.4   200063.7     1200834 {txt}{c |}
 94. {c |} {res}     94   164227.6   220308.3     1493083 {txt}{c |}
 95. {c |} {res}     95   179817.9   239361.9     1896592 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c RT}
 96. {c |} {res}     96   205284.5   278660.2     2381207 {txt}{c |}
 97. {c |} {res}     97   236765.9   333439.5     3178004 {txt}{c |}
 98. {c |} {res}     98   298098.8     460861     4629765 {txt}{c |}
 99. {c |} {res}     99   496049.5   802636.6     8358769 {txt}{c |}
     {c BLC}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 11}{c BRC}

{com}. 
. ***The end of Table 2 ***
. 
. log close Table2
      {txt}name:  {res}Table2
       {txt}log:  {res}/Users/Lan/Documents/GitHub/ps1-data-hitsukilan/analysis/output/Table2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Sep 2019, 21:12:03
{txt}{.-}
{smcl}
{txt}{sf}{ul off}